<template>
    <div class="size-chart">
        <h1 class="size-chart_title">ตารางไซส์</h1>
        
        <!-- Linear Measure Systems -->
        <div class="size-chart_systems">
          <p class="size_description">ขนาดรองเท้าหลัก ๆ มี 4 แบบ ได้แก่ US, UK, EU และ JPN ซึ่งแตกต่างกันไปตามแต่ละมาตรวัด:</p>
          <ul class="size_list">
              <li>US (American Linear Measure): เป็นมาตราฐานไซส์รองเท้าที่ใช้ในสหรัฐอเมริกาและแคนาดา ส่วนถูกใช้กันอย่างแพร่หลายทั่วโลก</li>
              <li>UK (English Linear Measure): เป็นมาตราฐานไซส์รองเท้าที่เริ่มใช้ในช่วงยุคอาณานิคม โดยเป็นระบบความยาวที่เหมาะสำหรับวัดรองเท้า และขนาดไม้อังประเทศนี้ ๆ ทั่วโลก</li>
              <li>EU (European Sizing): เป็นมาตราฐานไซส์รองเท้าในยุโรป คิดค้นขึ้นในไซส์ขนาดช่วงศตวรรษที่ 19</li>
              <li>JPN (Japanese Linear Measure): เป็นมาตราฐานไซส์รองเท้าของญี่ปุ่น ซึ่งจำแนกการเข้าใส่ เนื่องจาก มีการใช้หน่วยเป็นเซนติเมตร</li>
          </ul>
        </div>

        <!-- Shoe Types -->
        <div class="size-chart_shoe-types">
            <h2>1. ขนาดรองเท้าสำหรับผู้ชาย</h2>
            <p>รองเท้าผู้ชายมีลักษณะเฉพาะที่มีความกว้าง และความยาวมากกว่ารองเท้าผู้หญิง เนื่องจาก โดยทั่วไปเท้าผู้ชายจะมีขนาดที่ใหญ่กว่า ลักษณะเด่นของรองเท้าชายมีดังนี้:</p>
            <ul>
                <li>ความยาว: ขนาดเส้นผ่านของรองเท้าผู้ชายจะอยู่ในช่วงไซส์ที่ใหญ่กว่าผู้หญิง เช่น ขนาด US 7 ถึง 13 หรือมากกว่า ขึ้นอยู่กับชื่อยี่ห้อ และประเภทของรองเท้า</li>
                <li>ความกว้าง: รองเท้าโดยทั่วไปจะกว้างกว่ารองเท้าผู้หญิงเพื่อรองรับกล้ามเนื้อของเท้าที่ใหญ่กว่า</li>
                <li>การออกแบบ: รูปทรงรองเท้าผู้ชายจะเน้นความเรียบง่าย และเน้นที่ความแข็งแรง เช่น รองเท้ากีฬา รองเท้าทำงาน หรือรองเท้าลำลอง</li>
            </ul>

            <div class="image-container">
                <img src='@/assets/images/chart_men.png' alt="วิธีการวัดขนาดรองเท้าเด็ก" class="size-image">
            </div>

            <h2>2. ขนาดรองเท้าสำหรับผู้หญิง</h2>
            <p>รองเท้าผู้หญิงจะมีความละเอียดในเรื่องของดีไซน์และแบรนด์ เนื่องจาก เท้าผู้หญิงมีลักษณะเล็ก และแคบกว่าเมื่อเทียบกับเท้าผู้ชาย</p>
            <ul>
                <li>ความยาว: รองเท้าผู้หญิงมักมีขนาดเริ่มต้นเล็กกว่า เช่น US 5 ถึง 10 ขึ้นอยู่กับประเภทของรองเท้า</li>
                <li>ความกว้าง: เท้าผู้หญิงจะเล็ก และแคบกว่าผู้ชาย ดังนั้น รองเท้าผู้หญิงจึงออกแบบมาให้มีความกระชับมากกว่า</li>
                <li>การออกแบบ: รองเท้าผู้หญิงมีหลากหลายรูปแบบ ทั้งรองเท้าส้นสูง รองเท้าเพื่อโชว์ หรือรองเท้าแฟชั่น มีออกแบบเพื่อให้ดูเพรียว และทันสมัย</li>
            </ul>

            <div class="image-container">
                <img src='@/assets/images/chart_women.png' alt="วิธีการวัดขนาดรองเท้าเด็ก" class="size-image">
            </div>

            <h2>3. ขนาดรองเท้าสำหรับเด็ก</h2>
            <p>รองเท้าสำหรับเด็กมีเอกลักษณ์ของรองเท้าที่แตกต่างในด้านขนาด และการออกแบบ โดยเน้นความนุ่มสบาย และความยืดหยุ่นที่เหมาะสมกับเท้าที่กำลังเติบโต:</p>
            <ul>
                <li>ความยาว: ขนาดรองเท้าเด็กมีหลายช่วงตามอายุ เช่น เด็กเล็ก (ทารก และเด็กวัยคัดเดิน) มีขนาด US 0 ถึง 4 และเด็กโตจะมีขนาดตั้งแต่ US 5 ถึง 7 หรือใหญ่กว่านั้นขึ้นอยู่กับแบรนด์</li>
                <li>ความกว้าง: เท้าเด็กมักจะมีความอวบกว่าเท้าผู้ใหญ่ ดังนั้นรองเท้าสำหรับเด็กจะมีการออกแบบให้กว้างขึ้นเพื่อรองรับการเติบโต</li>
                <li>การออกแบบ: รองเท้าสำหรับเด็กเน้นความสะดวกสบาย เช่น มีสายรัดติดกิ๊บแทนเพื่อความง่ายในการสวมใส่ หรือรองเท้าทำให้มีช่องกุ้มเพื่อให้เคลื่อนไหวได้คล่องตัว</li>
            </ul>

            <div class="image-container">
                <img src='@/assets/images/chart_kids.png' alt="วิธีการวัดขนาดรองเท้าเด็ก" class="size-image">
            </div>

            <p>การเลือกขนาดรองเท้าให้พอดีเป็นสิ่งสำคัญเพื่อให้สวมใส่สบาย ป้องกันปัญหาสุขภาพเท้า และช่วยให้รองเท้ามีอายุการใช้งานยาวนานขึ้น การเลือกขนาดรองเท้าให้พอดีมีขั้นตอนที่ควร คำนึงถึงอย่างละเอียด ดังนี้:</p>

            <h3>1. วัดขนาดเท้าอย่างถูกต้อง</h3>
            <p>ก่อนการซื้อรองเท้า การวัดขนาดเท้าเป็นขั้นตอนสำคัญที่จะช่วยให้คุณเลือกขนาดรองเท้าที่เหมาะสม การวัดขนาดเท้าสามารถทำได้ง่าย ๆ ที่บ้านด้วยขั้นตอนดังนี้:</p>
            <ul>
                <li>เตรียมอุปกรณ์: ใช้กระดาษ A4 หรือขนาดใหญ่กว่า ดินสอ และไม้บรรทัดวัด</li>
                <li>ขนาดเท้า: ยืนบนกระดาษด้วยเท้าเปล่า (แนะนำให้ทำในช่วงเย็นเนื่องจากเท้าอาจขยายตัวหลังการเดินหรือยืนตลอดวัน) แล้วใช้ดินสอร่างขอบเท้าอย่างวัด</li>
                <li>ความยาว และความกว้าง: ใช้ไม้บรรทัดวัดจากเว้าที่ยาวที่สุดจนถึงส้นเท้า (ความยาว) และวัดความกว้างที่สุดของเท้า</li>
                <li>เปรียบเทียบตารางไซส์: นำข้อมูลที่วัดได้มาเปรียบเทียบกับตารางไซส์ของแบรนด์รองเท้าที่ต้องการซื้อ โดยคำนึงถึงความแตกต่างในแต่ละระบบ เช่น US, UK, EU, JPN</li>
            </ul>

            <h3>2. เลือกขนาดรองเท้าตามตารางไซส์</h3>
            <p>แบรนด์รองเท้าแต่ละแบรนด์อาจมีตารางไซส์ที่แตกต่างกัน ดังนั้นการเปรียบเทียบข้อมูลจากการวัดเท้ากับตารางไซส์ เป็นเรื่องที่สำคัญมาก 
            วิธีการเปรียบเทียบไซส์รองเท้าทำได้ดังนี้:</p>
            <ul>
                <li>ตารางไซส์ US, UK, EU, และ JPN: แบรนด์ต่างๆ จะมีตารางแปลงไซส์จากหน่วยที่คุณใช้เป็นหน่วยของประเทศต่าง ๆ เช่น เปรียบเทียบขนาด US กับ UK หรือ EU เพื่อเลือกขนาดที่เหมาะสม</li>
                <li>อ่านรีวิวขนาดจากผู้ใช้: หลายครั้ง ขนาดรองเท้าอาจแตกต่างกันเล็กน้อยตามการผลิต ดังนั้นการอ่านรีวิวจากผู้ใช้ที่ซื้อรองเท้าแบรนด์เดียวกันจะช่วยให้คุณตัดสินใจได้ดีขึ้น</li>
            </ul>  

            <h3>3. คำนึงถึงประเภทของรองเท้า</h3>
            <p>ก่อนการซื้อรองเท้า การวัดขนาดเท้าเป็นขั้นตอนสำคัญที่จะช่วยให้คุณเลือกขนาดรองเท้าที่เหมาะสม การวัดขนาดเท้าสามารถทำได้ง่าย ๆ ที่บ้านด้วยขั้นตอนดังนี้:</p>
            <ul>
                <li>รองเท้ากีฬา: ควรเลือกไซส์ที่ใหญ่ขึ้นเล็กน้อย (ประมาณครึ่งไซส์) เพื่อรองรับการเคลื่อนไหว และการขยายของเท้าในขณะออกกำลังกาย รวมถึงสวมถุงเท้ากีฬา</li>
                <li>รองเท้าลำลอง: ควรเลือกไซส์ที่พอดี เพื่อความสบายในการเดิน หรือใช้งานประจำวัน</li>
                <li>รองเท้าส้นสูง: ควรเลือกรองเท้าที่กระชับ และพอดีเท้า เพื่อป้องกันการลื่นไหล และให้การเดินสะดวกสบายยิ่งขึ้น</li>
            </ul>

            <h3>4. คำนึงถึงรูปทรงเท้า</h3>
            <p>ก่อนการซื้อรองเท้า การวัดขนาดเท้าเป็นขั้นตอนสำคัญที่จะช่วยให้คุณเลือกขนาดรองเท้าที่เหมาะสม การวัดขนาดเท้าสามารถทำได้ง่าย ๆ ที่บ้านด้วยขั้นตอนดังนี้:</p>
            <ul>
                <li>เท้ากว้าง: สำหรับคนที่มีเท้ากว้าง ควรเลือกขนาดรองเท้าที่ออกแบบมาสำหรับเท้ากว้าง หรือเพิ่มขนาดขึ้นเล็กน้อยเพื่อความสบาย</li>
                <li>เท้าแคบ: สำหรับคนที่มีเท้าแคบ ควรเลือกรองเท้าที่มีดีไซน์กระชับ และไม่กว้างเกินไป</li>
                <li>เท้าแบน: สำหรับผู้ที่มีเท้าแบน ควรเลือกรองเท้าที่มีรองรับอุ้งเท้า หรือใช้แผ่นรองเพื่อช่วยพยุงเท้า</li>
            </ul>

            <h3>5. คำนึงถึงวัสดุ และการยืดตัวของรองเท้า</h3>
            <p>ก่อนการซื้อรองเท้า การวัดขนาดเท้าเป็นขั้นตอนสำคัญที่จะช่วยให้คุณเลือกขนาดรองเท้าที่เหมาะสม การวัดขนาดเท้าสามารถทำได้ง่าย ๆ ที่บ้านด้วยขั้นตอนดังนี้:</p>
            <ul>
                <li>รองเท้าหนัง: มีความยืดหยุ่น และอาจยืดตัวเล็กน้อยเมื่อใช้งานไปสักระยะ ดังนั้นจึงควรเลือกขนาดที่กระชับแต่ไม่แน่นจนเกินไป</li>
                <li>รองเท้าผ้าใบ: วัสดุผ้าจะมีความยืดหยุ่นน้อยกว่า ดังนั้นการเลือกขนาดที่พอดีจะสำคัญมาก</li>
                <li>รองเท้าสังเคราะห์: วัสดุสังเคราะห์มักจะไม่ยืดตัวมาก ควรเลือกขนาดที่พอดีตั้งแต่แรก</li>
            </ul>

            <h3>6. คำแนะนำเฉพาะสำหรับเด็ก</h3>
            <p>สำหรับการเลือกขนาดรองเท้าเด็ก ควรเลือกขนาดที่ใหญ่ขึ้นเล็กน้อย เนื่องจากเท้าเด็กจะเติบโตอย่างรวดเร็ว การมีพื้นที่ว่างที่ปลายนิ้วเท้าประมาณ 0.5-1 ซม. จะช่วยให้รองเท้าใช้ได้ นานขึ้นโดยไม่คับเกินไป</p>
        </div>
    </div>
</template>

<script setup>
// No reactive data or methods needed for this static component
</script>

<style scoped>
  @font-face {
    font-family: 'Mitr';
    src: url('@/assets/fonts/Mitr-Regular.ttf') format('truetype');
    /* src: url('@/assets/fonts/Athiti-Bold.ttf') format('truetype'); */
    font-weight: normal;
    font-style: normal;
  }

  .image-container {
    text-align: center;
  }

  .size-image {
    max-width: 700px;
    height: auto;
  }

  .size-image img {
    width: 100%;
    height: auto;
    object-fit: contain;
  }  
   
  .size-chart {
    font-family: 'Mitr', sans-serif;
    font-size: 16px; /* Base font size */
    max-width: 1200px;
    margin: 0 auto 30px;
    padding: 5rem;
  }

  .size-chart_title {
    font-size: 1.5rem;
    font-weight: bold;
    text-align: center;
    margin-bottom: 3rem;
  }

  .size_description {
    font-size: 1.2rem;
    line-height: 1;
  }

  .size-chart_systems,
  .size-chart_shoe-types {
    font-size: 1.1rem;
    margin-bottom: 2rem;
  }

  .size-chart_shoe-types h2 
  {
    color: #222222;
    border-bottom: 2px solid #eee; /* ขีดเส้นใต้ */
    padding-bottom: 0.5rem;
  }

  .size_list {
    font-size: 1.1rem;
    list-style-type: disc;
    padding-left: 2rem;
  }

  .size_list li {
    margin-bottom: 0.75rem; /* ระยะห่างล่าง */
    line-height: 1.4; /* ความสูงของแต่ละบรรทัดจะเป็น 1.4 เท่าของขนาดฟอนต์ 16px × 1.4 */
  }

  h2 {
    font-size: 1.2rem;
    font-weight: bold;
    margin: 2rem 0 1rem;
  }

  h3 {
    font-size: 1.2rem;
    font-weight: bold;
    margin: 1.5rem 0 1rem;
  }

  p {
    margin-bottom: 1rem;
    line-height: 1.6;
  }

  ul {
    list-style-type: disc;
    padding-left: 2rem;
    margin-bottom: 2rem;
    }

  ul li {
    margin-bottom: 1rem;
    line-height: 1.6;
  }

  @keyframes slideIn {
  0% {
    transform: translateY(2.5%);
    opacity: 0;
  }
  100% {
    transform: translateY(0);
    opacity: 1;
  }
  }

  .size-chart {
    animation: slideIn 0.6s ease-out;
  }
</style>